app/controllers/admin/cases_controller.rb

SELECT * FROM `cases` WHERE (`cases`.`id` = 1)
---
  def show
    @Case = Case.find(params[:id])

INSERT INTO `cases` (`created_at`, `image_file_name`, `title`, `body`, `image_file_size`, `published`, `updated_at`, `image_content_type`, `sumary`, `image_updated_at`) VALUES('2010-05-06 15:25:38', NULL, 'Teste', 'Testeeeeeeee', NULL, 0, '2010-05-06 15:25:38', NULL, 'Aloo manooo', NULL)
---
  def create
    @Case = Case.create(params[:case])

SELECT * FROM `cases` WHERE (`cases`.`id` = 1)
---
  def edit
    @Case = Case.find(params[:id])

SELECT * FROM `cases` WHERE (`cases`.`id` = 1)
UPDATE `cases` SET `updated_at` = '2010-05-13 00:05:51', `image_updated_at` = '2010-05-13 00:05:51', `body` = '<p><strong>Lorem Ipsum</strong> is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type s</p>' WHERE `id` = 2
---
  def update
    @Case = Case.find(params[:id])
    @Case.attributes = params[:case]

    if @Case.save

SELECT * FROM `cases` WHERE (`cases`.`id` = 1)
DELETE FROM `cases` WHERE `id` = 1
---
  def destroy
    @Case = Case.find(params[:id])

    if @Case.destroy