app/controllers/admin/contacts_controller.rb

SELECT * FROM `sitecontacts` WHERE (`sitecontacts`.`id` = 15)
DELETE FROM `sitecontacts` WHERE `id` = 15
---
  def destroy
    @Contact = Sitecontact.find(params[:id])

    if @Contact.destroy