app/controllers/admin/prints_controller.rb

  def show
    @Print = Print.find(params[:id])
---
SELECT * FROM `prints` WHERE (`prints`.`id` = 1)

  def create
    @Print = Print.create(params[:print])
---
INSERT INTO `prints` (`created_at`, `image_file_name`, `title`, `image_file_size`, `updated_at`, `published`, `image_content_type`, `summary`, `description`, `image_updated_at`) VALUES('2010-06-01 19:09:57', 'HP_LJ_P2015DN.jpg', 'Impressora Monocromática', 7490, '2010-06-01 19:09:57', 0, 'image/jpeg', 'Robusta e compacta, esta impressora é ideal para pequenos escritórios.', '<p>Robusta e compacta, esta impressora &eacute; ideal para pequenos escrit&oacute;rios, com 27ppm , alta qualidade e com 32mb de mem&oacute;ria. Seu baixo custo de opera&ccedil;&atilde;o e op&ccedil;&otilde;es como rede e duplex facilitam o geren - ciamento e a produ&ccedil;&atilde;o de documentos.</p>', '2010-06-01 19:09:57')

  def edit
    @Print = Print.find(params[:id])
---
SELECT * FROM `prints` WHERE (`prints`.`id` = 1)

  def update
    @Print = Print.find(params[:id])
    @Print.attributes = params[:print]

    if @Print.save
---
SELECT * FROM `prints` WHERE (`prints`.`id` = 1)
UPDATE `prints` SET `updated_at` = '2010-06-01 19:12:00', `title` = 'HP LJ P2015DN', `description` = '<p>Robusta e compacta, esta impressora &eacute; ideal para pequenos escrit&oacute;rios, com 27ppm , alta qualidade e com 32mb de mem&oacute;ria. Seu baixo custo de opera&ccedil;&atilde;o e op&ccedil;&otilde;es como rede e duplex facilitam o gerenciamento e a produ&ccedil;&atilde;o de documentos.</p>' WHERE `id` = 1