app/controllers/admin/products_controller.rb

  def index
    @Products = @Category.products.find(:all)
---
SELECT * FROM `products` WHERE (`products`.category_id = 1)

  def show
    @Product = @Category.products.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1 AND (`products`.category_id = 1))

  def create
        @Product = @Category.products.create(params[:product])
---
INSERT INTO `products` (`created_at`, `title`, `published`, `updated_at`, `pdf_file_size`, `pdf_content_type`, `video_content_type`, `video_file_size`, `pdf_file_name`, `video_updated_at`, `category_id`, `pdf_updated_at`, `description`, `video_file_name`) VALUES('2010-05-12 23:10:49', 'FT 25', 1, '2010-05-12 23:10:49', 877861, 'application/pdf', NULL, NULL, 'pdf_esquemainstalacoes.pdf', NULL, 4, '2010-05-12 23:10:49', '<p>Muita &aacute;gua quente para sua praticidade e economia.</p>\r\n<p>&nbsp;</p>\r\n<p>A linha <em>Fasterm Home</em> &eacute; a solu&ccedil;&atilde;o residencial perfeita para o aquecimento de &aacute;gua para banho e outros pontos que exijam &aacute;gua quente reduzindo custos operacionais em at&eacute; 75% quando comparado com sistemas com resist&ecirc;ncias el&eacute;tricas e de at&eacute; 50% quando comparada a aquecedores a g&aacute;s e a diesel.</p>\r\n<p>&nbsp;</p>\r\n<p>Silencioso e ecologicamente correto o FT 25 produz at&eacute; 180 litros de &aacute;gua quente por hora, fazendo de cada banho uma experi&ecirc;ncia renovadora.</p>', NULL)

  def edit
    @Product = @Category.products.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1 AND (`products`.category_id = 1))

  def update
    @Product = @Category.products.find(params[:id])
    @Product.attributes = params[:product]

    if @Product.save
---
SELECT * FROM `products` WHERE (`products`.`id` = 1 AND (`products`.category_id = 1))
UPDATE `products` SET `updated_at` = '2010-05-11 21:23:44', `description` = '<p><strong>Lorem Ipsum</strong> is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum.</p>\r\n<div class=\"rc\">\r\n<h2 class=\"why\"><span>Why do we use it?</span></h2>\r\n<p>It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout. The point of using Lorem Ipsum is that it has a more-or-less normal distribution of letters, as opposed to using \'Content here, content here\', making it look like readable English. Many desktop publishing packages and web page editors now use Lorem Ipsum as their default model text, and a search for \'lorem ipsum\' will uncover many web sites still in their infancy. Various versions have evolved over the years, sometimes by accident, sometimes on purpose (injected humour and the like).</p>\r\n</div>' WHERE `id` = 1

  def destroy
    @Product = @Category.products.find(params[:id])

    if @Product.destroy
---
SELECT * FROM `products` WHERE (`products`.`id` = 2 AND (`products`.category_id = 1))
DELETE FROM `products` WHERE `id` = 2

  def load_category
    if session[:logged]
      true
    else
      redirect_to new_admin_session_path
    end

    @Category = Category.find(params[:category_id])
---
SELECT * FROM `categories` WHERE (`categories`.`id` = 1)